Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/npolar.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: In SCAR, scientific activities are carried out by Standing Scientific Groups.
nn: Den vitskapelege verksemda blir i SCAR utført av arbeidsgrupper (Standing Scientific Groups).
